/**
 * Created by Dell on 2015/10/14.
 */
var data = {
    hot: [
        {
            'pid': 1,
            'pname': '北京',
            'id': 2,
            'name': '北京'
        },
        {
            'pid': 21,
            'pname': '上海',
            'id': 22,
            'name': '上海'
        },
        {
            'pid': 423,
            'pname': '广东',
            'id': 424,
            'name': '广州'
        },
        {
            'pid': 423,
            'pname': '广东',
            'id': 524,
            'name': '深圳'
        },
        {
            'pid': 1643,
            'pname': '江苏',
            'id': 1644,
            'name': '南京'
        }
    ],
    province: [
        {
            "id": 1,
            "name": "北京",
            "city": [
                {
                    "id": 2,
                    "name": "北京"
                }
            ]
        },
        {
            "id": 1874,
            "name": "辽宁",
            "city": [
                {
                    "id": 1875,
                    "name": "沈阳"
                },
                {
                    "id": 1974,
                    "name": "铁岭"
                },
                {
                    "id": 1969,
                    "name": "盘锦"
                },
                {
                    "id": 1961,
                    "name": "辽阳"
                },
                {
                    "id": 1953,
                    "name": "锦州"
                },
                {
                    "id": 1946,
                    "name": "葫芦岛"
                },
                {
                    "id": 1938,
                    "name": "阜新"
                },
                {
                    "id": 1930,
                    "name": "抚顺"
                },
                {
                    "id": 1923,
                    "name": "丹东"
                },
                {
                    "id": 1912,
                    "name": "大连"
                },
                {
                    "id": 1904,
                    "name": "朝阳"
                },
                {
                    "id": 1897,
                    "name": "本溪"
                },
                {
                    "id": 1889,
                    "name": "鞍山"
                },
                {
                    "id": 1982,
                    "name": "营口"
                }
            ]
        },
        {
            "id": 1989,
            "name": "内蒙古",
            "city": [
                {
                    "id": 1990,
                    "name": "呼和浩特"
                },
                {
                    "id": 2083,
                    "name": "锡林郭勒盟"
                },
                {
                    "id": 2071,
                    "name": "乌兰察布"
                },
                {
                    "id": 2067,
                    "name": "乌海"
                },
                {
                    "id": 2058,
                    "name": "通辽"
                },
                {
                    "id": 2044,
                    "name": "呼伦贝尔"
                },
                {
                    "id": 2035,
                    "name": "鄂尔多斯"
                },
                {
                    "id": 2022,
                    "name": "赤峰"
                },
                {
                    "id": 2012,
                    "name": "包头"
                },
                {
                    "id": 2004,
                    "name": "巴彦淖尔"
                },
                {
                    "id": 2000,
                    "name": "阿拉善盟"
                },
                {
                    "id": 2096,
                    "name": "兴安盟"
                }
            ]
        },
        {
            "id": 2103,
            "name": "宁夏",
            "city": [
                {
                    "id": 2104,
                    "name": "银川"
                },
                {
                    "id": 2111,
                    "name": "固原"
                },
                {
                    "id": 2117,
                    "name": "石嘴山"
                },
                {
                    "id": 2121,
                    "name": "吴忠"
                },
                {
                    "id": 2126,
                    "name": "中卫"
                }
            ]
        },
        {
            "id": 2130,
            "name": "青海",
            "city": [
                {
                    "id": 2131,
                    "name": "西宁"
                },
                {
                    "id": 2139,
                    "name": "果洛藏族自治州"
                },
                {
                    "id": 2146,
                    "name": "海北藏族自治州"
                },
                {
                    "id": 2151,
                    "name": "海东地区"
                },
                {
                    "id": 2158,
                    "name": "海南藏族自治州"
                },
                {
                    "id": 2164,
                    "name": "海西蒙古族藏族自治州"
                },
                {
                    "id": 2170,
                    "name": "黄南藏族自治州"
                },
                {
                    "id": 2175,
                    "name": "玉树藏族自治州"
                }
            ]
        },
        {
            "id": 2182,
            "name": "山东",
            "city": [
                {
                    "id": 2183,
                    "name": "济南"
                },
                {
                    "id": 2324,
                    "name": "枣庄"
                },
                {
                    "id": 2311,
                    "name": "烟台"
                },
                {
                    "id": 2298,
                    "name": "潍坊"
                },
                {
                    "id": 2293,
                    "name": "威海"
                },
                {
                    "id": 2286,
                    "name": "泰安"
                },
                {
                    "id": 2281,
                    "name": "日照"
                },
                {
                    "id": 2268,
                    "name": "青岛"
                },
                {
                    "id": 2255,
                    "name": "临沂"
                },
                {
                    "id": 2246,
                    "name": "聊城"
                },
                {
                    "id": 2243,
                    "name": "莱芜"
                },
                {
                    "id": 2230,
                    "name": "济宁"
                },
                {
                    "id": 2220,
                    "name": "菏泽"
                },
                {
                    "id": 2214,
                    "name": "东营"
                },
                {
                    "id": 2202,
                    "name": "德州"
                },
                {
                    "id": 2194,
                    "name": "滨州"
                },
                {
                    "id": 2331,
                    "name": "淄博"
                }
            ]
        },
        {
            "id": 2340,
            "name": "山西",
            "city": [
                {
                    "id": 2341,
                    "name": "太原"
                },
                {
                    "id": 2451,
                    "name": "阳泉"
                },
                {
                    "id": 2436,
                    "name": "忻州"
                },
                {
                    "id": 2429,
                    "name": "朔州"
                },
                {
                    "id": 2415,
                    "name": "吕梁"
                },
                {
                    "id": 2397,
                    "name": "临汾"
                },
                {
                    "id": 2385,
                    "name": "晋中"
                },
                {
                    "id": 2378,
                    "name": "晋城"
                },
                {
                    "id": 2366,
                    "name": "大同"
                },
                {
                    "id": 2352,
                    "name": "长治"
                },
                {
                    "id": 2457,
                    "name": "运城"
                }
            ]
        },
        {
            "id": 2471,
            "name": "陕西",
            "city": [
                {
                    "id": 2472,
                    "name": "西安"
                },
                {
                    "id": 2562,
                    "name": "延安"
                },
                {
                    "id": 2547,
                    "name": "咸阳"
                },
                {
                    "id": 2535,
                    "name": "渭南"
                },
                {
                    "id": 2530,
                    "name": "铜川"
                },
                {
                    "id": 2522,
                    "name": "商洛"
                },
                {
                    "id": 2510,
                    "name": "汉中"
                },
                {
                    "id": 2497,
                    "name": "宝鸡"
                },
                {
                    "id": 2486,
                    "name": "安康"
                },
                {
                    "id": 2576,
                    "name": "榆林"
                }
            ]
        },
        {
            "id": 2589,
            "name": "四川",
            "city": [
                {
                    "id": 2590,
                    "name": "成都"
                },
                {
                    "id": 2722,
                    "name": "绵阳"
                },
                {
                    "id": 2732,
                    "name": "内江"
                },
                {
                    "id": 2738,
                    "name": "南充"
                },
                {
                    "id": 2748,
                    "name": "攀枝花"
                },
                {
                    "id": 2754,
                    "name": "遂宁"
                },
                {
                    "id": 2760,
                    "name": "雅安"
                },
                {
                    "id": 2769,
                    "name": "宜宾"
                },
                {
                    "id": 2780,
                    "name": "资阳"
                },
                {
                    "id": 2715,
                    "name": "眉山"
                },
                {
                    "id": 2707,
                    "name": "泸州"
                },
                {
                    "id": 2689,
                    "name": "凉山彝族自治州"
                },
                {
                    "id": 2610,
                    "name": "阿坝藏族羌族自治州"
                },
                {
                    "id": 2624,
                    "name": "巴中"
                },
                {
                    "id": 2629,
                    "name": "达州"
                },
                {
                    "id": 2637,
                    "name": "德阳"
                },
                {
                    "id": 2644,
                    "name": "甘孜藏族自治州"
                },
                {
                    "id": 2663,
                    "name": "广安"
                },
                {
                    "id": 2669,
                    "name": "广元"
                },
                {
                    "id": 2677,
                    "name": "乐山"
                },
                {
                    "id": 2785,
                    "name": "自贡"
                }
            ]
        },
        {
            "id": 2792,
            "name": "西藏",
            "city": [
                {
                    "id": 2793,
                    "name": "拉萨"
                },
                {
                    "id": 2802,
                    "name": "阿里地区"
                },
                {
                    "id": 2810,
                    "name": "昌都地区"
                },
                {
                    "id": 2822,
                    "name": "林芝地区"
                },
                {
                    "id": 2830,
                    "name": "那曲地区"
                },
                {
                    "id": 2841,
                    "name": "日喀则地区"
                },
                {
                    "id": 2860,
                    "name": "山南地区"
                }
            ]
        },
        {
            "id": 2873,
            "name": "新疆",
            "city": [
                {
                    "id": 2874,
                    "name": "乌鲁木齐"
                },
                {
                    "id": 2975,
                    "name": "五家渠"
                },
                {
                    "id": 2971,
                    "name": "吐鲁番地区"
                },
                {
                    "id": 2970,
                    "name": "图木舒克"
                },
                {
                    "id": 2962,
                    "name": "塔城地区"
                },
                {
                    "id": 2961,
                    "name": "石河子"
                },
                {
                    "id": 2956,
                    "name": "克孜勒苏柯尔克孜自治州"
                },
                {
                    "id": 2951,
                    "name": "克拉玛依"
                },
                {
                    "id": 2938,
                    "name": "喀什地区"
                },
                {
                    "id": 2929,
                    "name": "和田地区"
                },
                {
                    "id": 2925,
                    "name": "哈密地区"
                },
                {
                    "id": 2916,
                    "name": "昌吉回族自治州"
                },
                {
                    "id": 2912,
                    "name": "博尔塔拉蒙古自治州"
                },
                {
                    "id": 2902,
                    "name": "巴音郭楞蒙古自治州"
                },
                {
                    "id": 2894,
                    "name": "阿勒泰地区"
                },
                {
                    "id": 2893,
                    "name": "阿拉尔"
                },
                {
                    "id": 2883,
                    "name": "阿克苏地区"
                },
                {
                    "id": 2976,
                    "name": "伊犁哈萨克自治州"
                }
            ]
        },
        {
            "id": 2987,
            "name": "云南",
            "city": [
                {
                    "id": 2988,
                    "name": "昆明"
                },
                {
                    "id": 3121,
                    "name": "昭通"
                },
                {
                    "id": 3111,
                    "name": "玉溪"
                },
                {
                    "id": 3107,
                    "name": "西双版纳傣族自治州"
                },
                {
                    "id": 3098,
                    "name": "文山壮族苗族自治州"
                },
                {
                    "id": 3087,
                    "name": "思茅"
                },
                {
                    "id": 3077,
                    "name": "曲靖"
                },
                {
                    "id": 3072,
                    "name": "怒江傈僳族自治州"
                },
                {
                    "id": 3063,
                    "name": "临沧"
                },
                {
                    "id": 3057,
                    "name": "丽江"
                },
                {
                    "id": 3043,
                    "name": "红河哈尼族彝族自治州"
                },
                {
                    "id": 3039,
                    "name": "迪庆藏族自治州"
                },
                {
                    "id": 3033,
                    "name": "德宏傣族景颇族自治州"
                },
                {
                    "id": 3020,
                    "name": "大理白族自治州"
                },
                {
                    "id": 3009,
                    "name": "楚雄彝族自治州"
                },
                {
                    "id": 3003,
                    "name": "保山"
                },
                {
                    "id": 3294,
                    "name": "普洱"
                }
            ]
        },
        {
            "id": 3133,
            "name": "浙江",
            "city": [
                {
                    "id": 3134,
                    "name": "杭州"
                },
                {
                    "id": 3218,
                    "name": "温州"
                },
                {
                    "id": 3208,
                    "name": "台州"
                },
                {
                    "id": 3201,
                    "name": "绍兴"
                },
                {
                    "id": 3194,
                    "name": "衢州"
                },
                {
                    "id": 3182,
                    "name": "宁波"
                },
                {
                    "id": 3172,
                    "name": "丽水"
                },
                {
                    "id": 3162,
                    "name": "金华"
                },
                {
                    "id": 3154,
                    "name": "嘉兴"
                },
                {
                    "id": 3148,
                    "name": "湖州"
                },
                {
                    "id": 3230,
                    "name": "舟山"
                }
            ]
        },
        {
            "id": 3235,
            "name": "香港",
            "city": [
                {
                    "id": 3236,
                    "name": "九龙"
                },
                {
                    "id": 3237,
                    "name": "香港岛"
                },
                {
                    "id": 3238,
                    "name": "新界"
                }
            ]
        },
        {
            "id": 3239,
            "name": "澳门",
            "city": [
                {
                    "id": 3240,
                    "name": "澳门半岛"
                },
                {
                    "id": 3241,
                    "name": "离岛"
                }
            ]
        },
        {
            "id": 3242,
            "name": "台湾",
            "city": [
                {
                    "id": 3243,
                    "name": "台北"
                },
                {
                    "id": 3256,
                    "name": "台东县"
                },
                {
                    "id": 3257,
                    "name": "台南"
                },
                {
                    "id": 3258,
                    "name": "台南县"
                },
                {
                    "id": 3259,
                    "name": "台中"
                },
                {
                    "id": 3260,
                    "name": "台中县"
                },
                {
                    "id": 3261,
                    "name": "桃园县"
                },
                {
                    "id": 3262,
                    "name": "新竹"
                },
                {
                    "id": 3263,
                    "name": "新竹县"
                },
                {
                    "id": 3264,
                    "name": "宜兰县"
                },
                {
                    "id": 3265,
                    "name": "云林县"
                },
                {
                    "id": 3255,
                    "name": "台北县"
                },
                {
                    "id": 3254,
                    "name": "屏东县"
                },
                {
                    "id": 3244,
                    "name": "高雄"
                },
                {
                    "id": 3245,
                    "name": "高雄县"
                },
                {
                    "id": 3246,
                    "name": "花莲县"
                },
                {
                    "id": 3247,
                    "name": "基隆"
                },
                {
                    "id": 3248,
                    "name": "嘉义"
                },
                {
                    "id": 3249,
                    "name": "嘉义县"
                },
                {
                    "id": 3250,
                    "name": "金门县"
                },
                {
                    "id": 3251,
                    "name": "苗栗县"
                },
                {
                    "id": 3252,
                    "name": "南投县"
                },
                {
                    "id": 3253,
                    "name": "澎湖县"
                },
                {
                    "id": 3266,
                    "name": "彰化县"
                }
            ]
        },
        /*{
            "id": 3267,
            "name": "欧洲",
            "city": [
                {
                    "id": 3268,
                    "name": "法国"
                },
                {
                    "id": 3269,
                    "name": "比利时"
                },
                {
                    "id": 3270,
                    "name": "英国"
                },
                {
                    "id": 3271,
                    "name": "德国"
                },
                {
                    "id": 3272,
                    "name": "意大利"
                },
                {
                    "id": 3279,
                    "name": "希腊"
                },
                {
                    "id": 3280,
                    "name": "瑞典"
                }
            ]
        },*/
        {
            "id": 1763,
            "name": "江西",
            "city": [
                {
                    "id": 1764,
                    "name": "南昌"
                },
                {
                    "id": 1859,
                    "name": "宜春"
                },
                {
                    "id": 1856,
                    "name": "新余"
                },
                {
                    "id": 1843,
                    "name": "上饶"
                },
                {
                    "id": 1837,
                    "name": "萍乡"
                },
                {
                    "id": 1824,
                    "name": "九江"
                },
                {
                    "id": 1819,
                    "name": "景德镇"
                },
                {
                    "id": 1805,
                    "name": "吉安"
                },
                {
                    "id": 1786,
                    "name": "赣州"
                },
                {
                    "id": 1774,
                    "name": "抚州"
                },
                {
                    "id": 1870,
                    "name": "鹰潭"
                }
            ]
        },
        {
            "id": 1643,
            "name": "江苏",
            "city": [
                {
                    "id": 1644,
                    "name": "南京"
                },
                {
                    "id": 1748,
                    "name": "扬州"
                },
                {
                    "id": 1738,
                    "name": "盐城"
                },
                {
                    "id": 1726,
                    "name": "徐州"
                },
                {
                    "id": 1717,
                    "name": "无锡"
                },
                {
                    "id": 1710,
                    "name": "泰州"
                },
                {
                    "id": 1704,
                    "name": "宿迁"
                },
                {
                    "id": 1692,
                    "name": "苏州"
                },
                {
                    "id": 1683,
                    "name": "南通"
                },
                {
                    "id": 1675,
                    "name": "连云港"
                },
                {
                    "id": 1666,
                    "name": "淮安"
                },
                {
                    "id": 1658,
                    "name": "常州"
                },
                {
                    "id": 1756,
                    "name": "镇江"
                }
            ]
        },
        {
            "id": 21,
            "name": "上海",
            "city": [
                {
                    "id": 22,
                    "name": "上海"
                }
            ]
        },
        {
            "id": 42,
            "name": "天津",
            "city": [
                {
                    "id": 43,
                    "name": "天津"
                }
            ]
        },
        {
            "id": 62,
            "name": "重庆",
            "city": [
                {
                    "id": 63,
                    "name": "重庆"
                }
            ]
        },
        {
            "id": 104,
            "name": "安徽",
            "city": [
                {
                    "id": 105,
                    "name": "合肥"
                },
                {
                    "id": 211,
                    "name": "芜湖"
                },
                {
                    "id": 206,
                    "name": "铜陵"
                },
                {
                    "id": 200,
                    "name": "宿州"
                },
                {
                    "id": 195,
                    "name": "马鞍山"
                },
                {
                    "id": 187,
                    "name": "六安"
                },
                {
                    "id": 179,
                    "name": "黄山"
                },
                {
                    "id": 172,
                    "name": "淮南"
                },
                {
                    "id": 167,
                    "name": "淮北"
                },
                {
                    "id": 158,
                    "name": "阜阳"
                },
                {
                    "id": 149,
                    "name": "滁州"
                },
                {
                    "id": 144,
                    "name": "池州"
                },
                {
                    "id": 138,
                    "name": "巢湖"
                },
                {
                    "id": 133,
                    "name": "亳州"
                },
                {
                    "id": 125,
                    "name": "蚌埠"
                },
                {
                    "id": 113,
                    "name": "安庆"
                },
                {
                    "id": 219,
                    "name": "宣城"
                }
            ]
        },
        {
            "id": 227,
            "name": "福建",
            "city": [
                {
                    "id": 228,
                    "name": "福州"
                },
                {
                    "id": 242,
                    "name": "龙岩"
                },
                {
                    "id": 250,
                    "name": "南平"
                },
                {
                    "id": 261,
                    "name": "宁德"
                },
                {
                    "id": 271,
                    "name": "莆田"
                },
                {
                    "id": 277,
                    "name": "泉州"
                },
                {
                    "id": 290,
                    "name": "三明"
                },
                {
                    "id": 303,
                    "name": "厦门"
                },
                {
                    "id": 310,
                    "name": "漳州"
                }
            ]
        },
        {
            "id": 322,
            "name": "甘肃",
            "city": [
                {
                    "id": 323,
                    "name": "兰州"
                },
                {
                    "id": 411,
                    "name": "武威"
                },
                {
                    "id": 403,
                    "name": "天水"
                },
                {
                    "id": 394,
                    "name": "庆阳"
                },
                {
                    "id": 386,
                    "name": "平凉"
                },
                {
                    "id": 376,
                    "name": "陇南"
                },
                {
                    "id": 367,
                    "name": "临夏回族自治州"
                },
                {
                    "id": 359,
                    "name": "酒泉"
                },
                {
                    "id": 356,
                    "name": "金昌"
                },
                {
                    "id": 355,
                    "name": "嘉峪关"
                },
                {
                    "id": 346,
                    "name": "甘南藏族自治州"
                },
                {
                    "id": 338,
                    "name": "定西"
                },
                {
                    "id": 332,
                    "name": "白银"
                },
                {
                    "id": 416,
                    "name": "张掖"
                }
            ]
        },
        {
            "id": 423,
            "name": "广东",
            "city": [
                {
                    "id": 424,
                    "name": "广州"
                },
                {
                    "id": 500,
                    "name": "汕头"
                },
                {
                    "id": 508,
                    "name": "汕尾"
                },
                {
                    "id": 513,
                    "name": "韶关"
                },
                {
                    "id": 524,
                    "name": "深圳"
                },
                {
                    "id": 531,
                    "name": "阳江"
                },
                {
                    "id": 536,
                    "name": "云浮"
                },
                {
                    "id": 542,
                    "name": "湛江"
                },
                {
                    "id": 552,
                    "name": "肇庆"
                },
                {
                    "id": 561,
                    "name": "中山"
                },
                {
                    "id": 491,
                    "name": "清远"
                },
                {
                    "id": 483,
                    "name": "梅州"
                },
                {
                    "id": 437,
                    "name": "潮州"
                },
                {
                    "id": 441,
                    "name": "东莞"
                },
                {
                    "id": 442,
                    "name": "佛山"
                },
                {
                    "id": 448,
                    "name": "河源"
                },
                {
                    "id": 455,
                    "name": "惠州"
                },
                {
                    "id": 461,
                    "name": "江门"
                },
                {
                    "id": 469,
                    "name": "揭阳"
                },
                {
                    "id": 475,
                    "name": "茂名"
                },
                {
                    "id": 482,
                    "name": "梅江区"
                },
                {
                    "id": 562,
                    "name": "珠海"
                }
            ]
        },
        {
            "id": 566,
            "name": "广西",
            "city": [
                {
                    "id": 567,
                    "name": "南宁"
                },
                {
                    "id": 675,
                    "name": "梧州"
                },
                {
                    "id": 670,
                    "name": "钦州"
                },
                {
                    "id": 659,
                    "name": "柳州"
                },
                {
                    "id": 652,
                    "name": "来宾"
                },
                {
                    "id": 647,
                    "name": "贺州"
                },
                {
                    "id": 635,
                    "name": "河池"
                },
                {
                    "id": 617,
                    "name": "桂林"
                },
                {
                    "id": 611,
                    "name": "贵港"
                },
                {
                    "id": 606,
                    "name": "防城港"
                },
                {
                    "id": 598,
                    "name": "崇左"
                },
                {
                    "id": 593,
                    "name": "北海"
                },
                {
                    "id": 580,
                    "name": "百色"
                },
                {
                    "id": 683,
                    "name": "玉林"
                }
            ]
        },
        {
            "id": 690,
            "name": "贵州",
            "city": [
                {
                    "id": 691,
                    "name": "贵阳"
                },
                {
                    "id": 702,
                    "name": "安顺"
                },
                {
                    "id": 709,
                    "name": "毕节地区"
                },
                {
                    "id": 718,
                    "name": "六盘水"
                },
                {
                    "id": 723,
                    "name": "黔东南苗族侗族自治州"
                },
                {
                    "id": 740,
                    "name": "黔南布依族苗族自治州"
                },
                {
                    "id": 753,
                    "name": "黔西南布依族苗族自治州"
                },
                {
                    "id": 762,
                    "name": "铜仁地区"
                },
                {
                    "id": 773,
                    "name": "遵义"
                }
            ]
        },
        {
            "id": 788,
            "name": "海南",
            "city": [
                {
                    "id": 789,
                    "name": "海口"
                },
                {
                    "id": 805,
                    "name": "琼海"
                },
                {
                    "id": 806,
                    "name": "琼中黎族苗族自治县"
                },
                {
                    "id": 807,
                    "name": "三亚"
                },
                {
                    "id": 808,
                    "name": "屯昌县"
                },
                {
                    "id": 809,
                    "name": "万宁"
                },
                {
                    "id": 810,
                    "name": "文昌"
                },
                {
                    "id": 811,
                    "name": "五指山"
                },
                {
                    "id": 812,
                    "name": "西沙群岛"
                },
                {
                    "id": 804,
                    "name": "南沙群岛"
                },
                {
                    "id": 803,
                    "name": "陵水黎族自治县"
                },
                {
                    "id": 802,
                    "name": "临高县"
                },
                {
                    "id": 794,
                    "name": "白沙黎族自治县"
                },
                {
                    "id": 795,
                    "name": "保亭黎族苗族自治县"
                },
                {
                    "id": 796,
                    "name": "昌江黎族自治县"
                },
                {
                    "id": 797,
                    "name": "澄迈县"
                },
                {
                    "id": 798,
                    "name": "儋州"
                },
                {
                    "id": 799,
                    "name": "定安县"
                },
                {
                    "id": 800,
                    "name": "东方"
                },
                {
                    "id": 801,
                    "name": "乐东黎族自治县"
                },
                {
                    "id": 813,
                    "name": "中沙群岛的岛礁及其海域"
                }
            ]
        },
        {
            "id": 814,
            "name": "河北",
            "city": [
                {
                    "id": 815,
                    "name": "石家庄"
                },
                {
                    "id": 960,
                    "name": "邢台"
                },
                {
                    "id": 945,
                    "name": "唐山"
                },
                {
                    "id": 937,
                    "name": "秦皇岛"
                },
                {
                    "id": 926,
                    "name": "廊坊"
                },
                {
                    "id": 914,
                    "name": "衡水"
                },
                {
                    "id": 894,
                    "name": "邯郸"
                },
                {
                    "id": 882,
                    "name": "承德"
                },
                {
                    "id": 865,
                    "name": "沧州"
                },
                {
                    "id": 839,
                    "name": "保定"
                },
                {
                    "id": 980,
                    "name": "张家口"
                }
            ]
        },
        {
            "id": 998,
            "name": "河南",
            "city": [
                {
                    "id": 999,
                    "name": "郑州"
                },
                {
                    "id": 1154,
                    "name": "周口"
                },
                {
                    "id": 1147,
                    "name": "许昌"
                },
                {
                    "id": 1136,
                    "name": "信阳"
                },
                {
                    "id": 1123,
                    "name": "新乡"
                },
                {
                    "id": 1113,
                    "name": "商丘"
                },
                {
                    "id": 1106,
                    "name": "三门峡"
                },
                {
                    "id": 1099,
                    "name": "濮阳"
                },
                {
                    "id": 1088,
                    "name": "平顶山"
                },
                {
                    "id": 1074,
                    "name": "南阳"
                },
                {
                    "id": 1068,
                    "name": "漯河"
                },
                {
                    "id": 1052,
                    "name": "洛阳"
                },
                {
                    "id": 1041,
                    "name": "开封"
                },
                {
                    "id": 1029,
                    "name": "焦作"
                },
                {
                    "id": 1028,
                    "name": "济源"
                },
                {
                    "id": 1022,
                    "name": "鹤壁"
                },
                {
                    "id": 1012,
                    "name": "安阳"
                },
                {
                    "id": 1165,
                    "name": "驻马店"
                }
            ]
        },
        {
            "id": 1176,
            "name": "黑龙江",
            "city": [
                {
                    "id": 1177,
                    "name": "哈尔滨"
                },
                {
                    "id": 1291,
                    "name": "绥化"
                },
                {
                    "id": 1282,
                    "name": "双鸭山"
                },
                {
                    "id": 1265,
                    "name": "齐齐哈尔"
                },
                {
                    "id": 1260,
                    "name": "七台河"
                },
                {
                    "id": 1249,
                    "name": "牡丹江"
                },
                {
                    "id": 1237,
                    "name": "佳木斯"
                },
                {
                    "id": 1227,
                    "name": "鸡西"
                },
                {
                    "id": 1220,
                    "name": "黑河"
                },
                {
                    "id": 1211,
                    "name": "鹤岗"
                },
                {
                    "id": 1207,
                    "name": "大兴安岭地区"
                },
                {
                    "id": 1197,
                    "name": "大庆"
                },
                {
                    "id": 1302,
                    "name": "伊春"
                }
            ]
        },
        {
            "id": 1320,
            "name": "湖北",
            "city": [
                {
                    "id": 1321,
                    "name": "武汉"
                },
                {
                    "id": 1422,
                    "name": "宜昌"
                },
                {
                    "id": 1414,
                    "name": "孝感"
                },
                {
                    "id": 1404,
                    "name": "襄樊"
                },
                {
                    "id": 1397,
                    "name": "咸宁"
                },
                {
                    "id": 1396,
                    "name": "仙桃"
                },
                {
                    "id": 1395,
                    "name": "天门"
                },
                {
                    "id": 1392,
                    "name": "随州"
                },
                {
                    "id": 1383,
                    "name": "十堰"
                },
                {
                    "id": 1382,
                    "name": "神农架林区"
                },
                {
                    "id": 1381,
                    "name": "潜江"
                },
                {
                    "id": 1372,
                    "name": "荆州"
                },
                {
                    "id": 1366,
                    "name": "荆门"
                },
                {
                    "id": 1359,
                    "name": "黄石"
                },
                {
                    "id": 1348,
                    "name": "黄冈"
                },
                {
                    "id": 1339,
                    "name": "恩施土家族苗族自治州"
                },
                {
                    "id": 1335,
                    "name": "鄂州"
                },
                {
                    "id": 3295,
                    "name": "襄阳"
                }
            ]
        },
        {
            "id": 1436,
            "name": "湖南",
            "city": [
                {
                    "id": 1437,
                    "name": "长沙"
                },
                {
                    "id": 1558,
                    "name": "张家界"
                },
                {
                    "id": 1548,
                    "name": "岳阳"
                },
                {
                    "id": 1536,
                    "name": "永州"
                },
                {
                    "id": 1529,
                    "name": "益阳"
                },
                {
                    "id": 1520,
                    "name": "湘西土家族苗族自治州"
                },
                {
                    "id": 1514,
                    "name": "湘潭"
                },
                {
                    "id": 1501,
                    "name": "邵阳"
                },
                {
                    "id": 1495,
                    "name": "娄底"
                },
                {
                    "id": 1482,
                    "name": "怀化"
                },
                {
                    "id": 1469,
                    "name": "衡阳"
                },
                {
                    "id": 1457,
                    "name": "郴州"
                },
                {
                    "id": 1447,
                    "name": "常德"
                },
                {
                    "id": 1563,
                    "name": "株洲"
                }
            ]
        },
        {
            "id": 1573,
            "name": "吉林",
            "city": [
                {
                    "id": 1574,
                    "name": "长春"
                },
                {
                    "id": 1585,
                    "name": "白城"
                },
                {
                    "id": 1591,
                    "name": "白山"
                },
                {
                    "id": 1598,
                    "name": "吉林"
                },
                {
                    "id": 1608,
                    "name": "辽源"
                },
                {
                    "id": 1613,
                    "name": "四平"
                },
                {
                    "id": 1620,
                    "name": "松原"
                },
                {
                    "id": 1626,
                    "name": "通化"
                },
                {
                    "id": 1634,
                    "name": "延边朝鲜族自治州"
                }
            ]
        }
    ]
};